/*
 FastcheckoutCoreKit.strings
 FastcheckoutKit

 Created by Javier Algaba Borrego on 22/03/2018.
 Copyright © 2018 MultiSafepay.com. All rights reserved.
 */

////////////
// Common //
////////////
common_label_loading = "Loading";
common_label_retry = "Retry";
common_label_payment_cancelled = "Payment cancelled by the user.";
common_label_pay_after_delivery = "Pay after delivery";
common_alert_button_ok = "Ok";
common_alert_button_cancel = "Cancel";
common_alert_warning_title = "⚠️";
common_alert_button_yes = "Yes";
common_alert_button_no = "No";
common_alert_button_email = "Email";
common_alert_authentication_message = "We're going to send you a security code. Where do you want us to send it?";
common_alert_authentication_salute = "Hi!";
common_alert_button_sms = "SMS";
common_button_skip = "Skip";
common_button_back_to_shop = "Back to Shop";
common_button_continue = "Continue";
common_button_submit = "Submit";
common_button_slide_to_pay = "Slide to pay";
common_error = "Oops!";
common_error_codes_must_match = "The code must match the one you introduced before.";
common_error_empty_data = "Response was empty.";
common_error_generic_validation = "Generic custom field validation error";
common_error_number_only = "The code must contain only digits.";
common_error_request_failed = "Request failed.";
common_error_request_unauthorized = "User needs authentication.";
common_error_payment_redirection = "Payment redirection failed.";
common_error_try_again = "An error has ocurred. Please, try again.";
common_error_unauthorized = "User's session not valid.";
common_session_did_timeout = "Session timeout";
common_error_invalid_pincode = "Wrong pincode";

/////////////////////
// Shipping Screen //
/////////////////////
shipping_screen_toolbar_title = "Delivery";
shipping_screen_section_select_shipping_title = "Select Shipping";
shipping_screen_alert_message_delete_address = "Are you sure you want to delete the address?";
shipping_screen_label_empty_shipping_methods_list = "No shipping methods available for this address";
shipping_screen_label_deliver_to = "Deliver to:";
shipping_screen_button_add_address_description = "Enter a delivery address";
shipping_screen_button_add_address_title = "Add an address";

////////////////////
// Payment Screen //
////////////////////
payment_screen_toolbar_title = "Payment";
payment_screen_section_add_giftcard_title = "Add Giftcard";
payment_screen_action_giftcards_available = "Gitfcards available";
payment_screen_button_pay_now = "Pay now";
payment_screen_button_go_to_bank = "Go to bank";
payment_screen_label_card_number = "Card Number";
payment_screen_label_card_holder_name = "Name";
payment_screen_label_card_expiry_date = "Expiry";
payment_screen_label_card_date_of_birth = "Date of birth";
payment_screen_label_card_iban = "IBAN";
payment_screen_label_card_fee = "Fee";

/////////////////////////
// Confirmation Screen //
/////////////////////////
confirmation_screen_toolbar_successful = "Successful";
confirmation_screen_toolbar_bank_transfer = "Transfer Details";
confirmation_screen_label_thanks = "Thank you for using";
confirmation_screen_label_email_sent_to = "A confirmation email has been sent to";
confirmation_screen_label_ship_to = "Your order will be shipped to:";
confirmation_screen_label_earned_balance = "You earned for your next purchase";
confirmation_screen_label_balance_updated = "Your new cashback balance";
confirmation_screen_label_paid_with_balance = "Used cashback balance";
confirmation_screen_label_paid_with_payment_method = "Paid with";
bank_transfer_screen_label_copy = "Copy";

/////////////////////
// Accounts Screen //
/////////////////////
accounts_screen_toolbar_title = "Users";
accounts_screen_section_select_account_title = "Select Account";
accounts_screen_section_continue_with_email_title = "Continue with your email";
accounts_screen_placeholder_email_address = "Email address";
accounts_screen_alert_message = "Are you sure you want to logout?";
accounts_screen_alert_message_already_logged_in = "You are already logged in with this account";

//////////////////////////
// Custom Fields Screen //
//////////////////////////
custom_fields_screen_button_next = "Next";

/////////////////////
// Pin Code Screen //
/////////////////////
pin_code_screen_label_enter_code = "Enter your quick code";
pin_code_screen_label_enter_new_code = "Please set your personal quick code for your next purchase";
pin_code_screen_label_sent_code = "We've sent a 6-digit safety code to you. Enter the code to continue.";
pin_code_screen_label_re_enter_code = "Enter the quick code again to confirm";
pin_code_screen_button_resend = "Resend";
pin_code_screen_button_reset = "Reset";
pin_code_screen_alert_fingerprint_authentication_label = "Log in";

/////////////////////
// Checkout Screen //
/////////////////////
checkout_screen_toolbar_title = "Shopping Cart";
checkout_screen_button_pay = "Pay";

/////////////////
// Cart Screen //
/////////////////
cart_screen_label_tax = "Taxes";
cart_screen_label_balance = "Cashback";
cart_screen_label_total = "Total";

///////////////////////
// Validation Screen //
///////////////////////
validation_screen_toolbar_title = "Validation";

///////////////////////
// My Details Screen //
///////////////////////
my_details_screen_toolbar_title = "Details";

////////////////////////////
// Payment Methods Screen //
////////////////////////////
payment_methods_screen_toolbar_title = "Payment Methods";
payment_methods_screen_label_go_shopping = "You don’t have any payments yet. Please make a purchase to add one.";
payment_methods_screen_button_go_shopping = "Start shopping";

///////////////////
// Pickup Screen //
///////////////////
pickup_screen_label_postal_code = "Postal code";

////////////////////////
// Biometrics Screen //
////////////////////////
biometrics_screen_label_touch_id = "Would you like to secure your PIN code with your fingerprint for future transactions?";
biometrics_screen_label_face_id = "Would you like to secure your PIN code with Face ID for future transactions?";
biometrics_screen_button_allow_touch_id = "Use Touch ID";
biometrics_screen_button_allow_face_id = "Use Face ID";
biometrics_screen_button_disallow_touch_id = "Do not use Touch ID";
biometrics_screen_button_disallow_face_id = "Do not use Face ID";

////////////////////
// Support Screen //
////////////////////
support_screen_toolbar_title_subject = "Subject";
support_screen_toolbar_title_message = "Message";
support_screen_action_question_not_in_list = "My question is not in the list";

/////////////////////////////////
// Support Confirmation Screen //
/////////////////////////////////
support_confirmation_screen_toolbar_title = "Thank you";

